Config/DataProcessors/ВыгрузкаСводОтчетов20.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаСводОтчетов20</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РежимОтладки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВыгрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыгрузкиФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПрисоединенныеФайлыДляВыгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отчет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УниверсальныйРегламентированныйОтчет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаПрисоединенныйФайл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УниверсальныйРегламентированныйОтчетПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтрокиОтчетов</v8:Type>
						<v8:Type>cfg:CatalogRef.Субконто</v8:Type>
						<v8:Type>cfg:CatalogRef.КолонкиОтчетов</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ЗначенияДополнительныхРеквизитовОтчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияДополнительныхРеквизитовОтчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаписьАктивна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйРеквизитОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеРеквизитыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭкземплярОтчета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УниверсальныйРегламентированныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАналитики</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикаОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АналитикаОтчетов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/АналитикаПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АналитикаПоказателей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АналитикаОтчетов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗаписьАктивна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭкземплярОтчета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УниверсальныйРегламентированныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаРаскрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыРаскрытия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАналитики</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикаОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ЗначенияПоказателейОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияПоказателейОтчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеЧисло</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеНеограниченнаяСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗаписьАктивна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПромежуточныйИтог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭкземплярОтчета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УниверсальныйРегламентированныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Documents/УниверсальныйРегламентированныйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УниверсальныйРегламентированныйОтчет</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Периоды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругленияОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньТочности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийРедактировавший</Name>
					<Comment>Пользователь, внесший последние изменения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоОбработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоПроверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаПроверки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редакция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РедакцииОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БланкиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеАналитики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПечатныйБланк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизвольныеБланкиФорм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатЗаполнения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Catalogs/СтрокиОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СтрокиОтчетов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаРаскрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыРаскрытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗначенийПоказателейОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОбработкиПоказателейОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/DataProcessors/ВыгрузкаСводОтчетов20/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Перем ВыгружатьДанныеЗаполнения;
Перем АдресПубликацииИБ;

////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>.
//  
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Заполнение информации обработки.
// Интерфейс

Функция ПолучитьВерсиюAPI() Экспорт 
	
	Возврат "3.0";
	
КонецФункции

Процедура ЗаполнитьИнформациюОбработки(ДанныеОбработки) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеОбработки.Версия = "1.0.0.4";
	ДанныеОбработки.Вставить("ИДФормата", "СВОД_2");
	ДанныеОбработки.Вставить("ПолучательОтчетности", "1С:Свод отчетов 8, 1С:Бюджетная отчетность 8");
	
	ДанныеОбработки.НаименованиеПоУмолчанию = НСтр("ru = 'Выгрузка бюджетной отчетности в формате «1С:Свод отчетов» 2.0'");
	ДанныеОбработки.ИнформацияОбОбработке = НСтр("ru = 'Выгрузка регламентированной бюджетной, бухгалтерской отчетности в формате «1С:Свод отчетов» 2.0 
													|для обеспечения интеграции с системами 1С:Свод отчетов 8, 1С:Бюджетная отчетность 8 (и другими, использующими указанный формат)'");
	
	ДанныеОбработки.СпособыОтправки.Добавить("Каталог");
	ДанныеОбработки.СпособыОтправки.Добавить("FTP");
	ДанныеОбработки.СпособыОтправки.Добавить("ЭлектроннаяПочта");
	
	Если БюджетнаяОтчетностьКлиентСервер.ТекущаяКонфигурация() = "БГУ2" Тогда 
		ДанныеОбработки.СпособыОтправки.Добавить("WebСервис");
	КонецЕсли;
	
	ДанныеОбработки.ВидыОтчетов = Новый Массив; // Обработка поддерживает все виды отчета, которые есть в системе.
	
	
	НоваяДопНастройка = ДанныеОбработки.ДополнительныеНастройки.Добавить();
	НоваяДопНастройка.Имя = "КодУчр";
	НоваяДопНастройка.Заголовок = НСтр("ru = 'Код для сдачи отчетности'");
	НоваяДопНастройка.ТипЗначения =  Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(3));
	//НоваяДопНастройка.СписокВыбора.Добавить(значение,Представление);
	НоваяДопНастройка.ЗначениеПоУмолчанию = "";
	НоваяДопНастройка.ЗапоминатьЗначение = Истина;
	НоваяДопНастройка.ПроверкаЗаполнения = Ложь;
	
	
	НоваяДопНастройка = ДанныеОбработки.ДополнительныеНастройки.Добавить();
	НоваяДопНастройка.Имя = "КодСценарияПолучателя";
	НоваяДопНастройка.Заголовок = НСтр("ru = 'Код сценария подготовки отчетности получателя'");
	НоваяДопНастройка.ТипЗначения =  Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(9));
	//НоваяДопНастройка.СписокВыбора.Добавить(значение,Представление);
	НоваяДопНастройка.ЗначениеПоУмолчанию = "";
	НоваяДопНастройка.ЗапоминатьЗначение = Истина;
	НоваяДопНастройка.ПроверкаЗаполнения = Ложь;

	
КонецПроцедуры

// Интерфейс
// Заполнение информации обработки.
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Заполнение таблицы зависимостей.
// Интерфейс

Процедура ЗаполнитьТаблицуЗависимостей(МассивОтчетов, ТаблицаЗависимостей, ДополнительныеНастройкиФормата) Экспорт
	
КонецПроцедуры	

// Интерфейс
// Заполнение таблицы зависимостей.
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// формирование файлов отчетов.
// Интерфейс

Процедура СформироватьФайлыОтчетов(ТаблицаДанных, ТаблицаЗависимостей, ДополнительныеНастройкиФормата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	

	Если ОбщегоНазначенияКлиентСервер.КлиентПодключенЧерезВебСервер() Тогда
		СтрокаСоединенияИБ = СтандартныеПодсистемыСервер.ПараметрыКлиентаНаСервере().Получить("СтрокаСоединенияИнформационнойБазы");
						
		ПараметрыСоединения = СтроковыеФункцииКлиентСервер.ПараметрыИзСтроки(СтрокаСоединенияИБ);
		Если ПараметрыСоединения.Свойство("WS") Тогда
			АдресПубликацииИБ = ПараметрыСоединения.WS;
		КонецЕсли;
		Если ЗначениеЗаполнено(АдресПубликацииИБ) Тогда
			Если НЕ СтрЗаканчиваетсяНа(АдресПубликацииИБ,"/") Тогда
				АдресПубликацииИБ = АдресПубликацииИБ + "/";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	
	СтруктураДанных = СформироватьСтруктуруДанныхФормированияФайлов();
	
	СтруктураДанных.ИсходныеДанные.ТаблицаДанных 		= ТаблицаДанных;
	СтруктураДанных.ИсходныеДанные.ТаблицаЗависимостей 	= ТаблицаЗависимостей;
	СтруктураДанных.ИсходныеДанные.ПараметрыВыгрузки 	= ДополнительныеНастройкиФормата;
	
	ИнициализацияФормированияФайлов(СтруктураДанных);
	
	
	Для Каждого СтрокаТаблицыДанных Из ТаблицаДанных Цикл 
		
		СтрокаТаблицыДанных.УИДОбработкиФормата = СтруктураДанных.ДО.УИДОбработкиФормата;
		
		СтруктураДанных.ТП.СтрокаТаблицыДанных = СтрокаТаблицыДанных;   
		ИнициализацияДанныхПакета(СтруктураДанных);
		
		ВыгрузитьОтчеты(СтруктураДанных);
		СформироватьВыходныеФайлы(СтруктураДанных);
		
		
		Попытка
			УдалитьФайлы(СтруктураДанных.ВременныйКаталог,"*"); // Удаление всех временных файлов.
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	Попытка
		УдалитьФайлы(СтруктураДанных.ВременныйКаталог); // Удаление самого временного каталога.
	Исключение
	КонецПопытки;
	
КонецПроцедуры

// Интерфейс
////////////////////////////////////////////////////////////////////////////////
// Служебные
// Инициализация
// Общая

Функция СформироватьСтруктуруДанныхФормированияФайлов()
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ДО",Новый Структура);  // ДанныеОбработки
	СтруктураДанных.ДО.Вставить("УИДОбработкиФормата");
	СтруктураДанных.ДО.Вставить("ТекстМоделиДанных");
	СтруктураДанных.ДО.Вставить("ТекстПравилОбходаДанных");
	СтруктураДанных.ДО.Вставить("URLПространстваИмен");
	СтруктураДанных.ДО.Вставить("ФабрикаОбъектов");
	СтруктураДанных.ДО.Вставить("Сериализатор");
	
	СтруктураДанных.Вставить("ТаблицаОписанийГруппировок",Новый ТаблицаЗначений);
	СтруктураДанных.ТаблицаОписанийГруппировок.Колонки.Добавить("Группировка", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(64, ДопустимаяДлина.Переменная)));
	СтруктураДанных.ТаблицаОписанийГруппировок.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)));
	СтруктураДанных.ТаблицаОписанийГруппировок.Колонки.Добавить("ПубличныйИдентификатор", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(256, ДопустимаяДлина.Переменная)));
	СтруктураДанных.ТаблицаОписанийГруппировок.Колонки.Добавить("Обязательная", Новый ОписаниеТипов("Булево"));
	
	СтруктураДанных.Вставить("ИсходныеДанные",Новый Структура);
	СтруктураДанных.ИсходныеДанные.Вставить("ТаблицаДанных");
	СтруктураДанных.ИсходныеДанные.Вставить("ТаблицаЗависимостей");
	СтруктураДанных.ИсходныеДанные.Вставить("ПараметрыВыгрузки");
	
	СтруктураДанных.Вставить("ВременныйКаталог");
	
	СтруктураДанных.Вставить("КодУчрежденияДляСдачиОтчетности");
	СтруктураДанных.Вставить("КодСценарияПолучателя");
	
	// Если ложь тогда используется КодУчрежденияДляСдачиОтчетности.
	СтруктураДанных.Вставить("ИспользоватьТаблицуКодовОрганизаций");
	СтруктураДанных.Вставить("ТаблицаКодовОрганизаций",Новый ТаблицаЗначений); // (Организация,КодДляСдачиОтчетности).
	
	СтруктураДанных.Вставить("СлужебныеДанныеОтчета");
	
	СтруктураДанных.Вставить("ТП",Новый Структура);		// Текущий пакет
	СтруктураДанных.ТП.Вставить("СтрокаТаблицыДанных");
	СтруктураДанных.ТП.Вставить("ПутьФайлаXML");
	СтруктураДанных.ТП.Вставить("ЗаписьXML");

	СтруктураДанных.ТП.Вставить("ДанныеОтчетов");
	СтруктураДанных.ТП.Вставить("ДанныеАналитикОтчетов");
	СтруктураДанных.ТП.Вставить("ДанныеКлючейСтрокОтчетов");
	СтруктураДанных.ТП.Вставить("ДанныеАналитикиРаскрытий");
	СтруктураДанных.ТП.Вставить("ДанныеСтрокОтчетов");
	
	СтруктураДанных.ТП.Вставить("ИспользуемыеГруппировки",Новый Массив);

	Возврат СтруктураДанных;
	
КонецФункции

Процедура ИнициализацияФормированияФайлов(СтруктураДанных)
	
	ЗаполнитьУИДОбработки(СтруктураДанных);
	СтруктураДанных.ДО.ТекстМоделиДанных = ПолучитьМакет("МодельДанных").ПолучитьТекст();
	СтруктураДанных.ДО.ТекстПравилОбходаДанных = ПолучитьМакет("ПравилаОбходаДанных").ПолучитьТекст();
	СтруктураДанных.ДО.URLПространстваИмен = "urn:schemas-1c-ru:reports/data";
	
	СтруктураДанных.ИспользоватьТаблицуКодовОрганизаций = Ложь;
	
	СоздатьФабрикуОбъектов(СтруктураДанных);
	ИнициализацияСериализатора(СтруктураДанных);
	ПодготовитьТаблицуОписанийГруппировок(СтруктураДанных);
	
	
	ПодготовитьВременныйКаталог(СтруктураДанных);
	ПрочитатьДанныеИзДопнастроекФормата(СтруктураДанных);
	ИнициализироватьТаблицуКодовОрганизаций(СтруктураДанных);
	
КонецПроцедуры

Процедура ЗаполнитьУИДОбработки(СтруктураДанных)
	СтруктураДанных.ДО.УИДОбработкиФормата = "dc573b4d-c71a-4864-a2f3-ed8783b50326"; 
КонецПроцедуры

Процедура СоздатьФабрикуОбъектов(СтруктураДанных)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтруктураДанных.ДО.ТекстМоделиДанных);
	Модель = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	ИменаПакетов = Новый Массив;
	ИменаПакетов.Добавить("http://v8.1c.ru/8.1/data/enterprise/current-config");
	
	Для Каждого Пакет Из ФабрикаXDTO.Пакеты Цикл
		ИменаПакетов.Добавить(Пакет.URIПространстваИмен);
	КонецЦикла;
	
	МодельКонфигурации = ФабрикаXDTO.ЭкспортМоделиXDTO(ИменаПакетов);
	
	МассивПакетовКонфигурации = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(МодельКонфигурации.package);
	
	Для Каждого ПакетКонфигурации Из МассивПакетовКонфигурации Цикл 
		
		Модель.package.Добавить(ПакетКонфигурации);
		
	КонецЦикла;
	
	СтруктураДанных.ДО.ФабрикаОбъектов =  Новый ФабрикаXDTO(Модель,ФабрикаXDTO.Пакеты);
	
КонецПроцедуры

Процедура ИнициализацияСериализатора(СтруктураДанных)
	
	ДиспетчерСериализации = Обработки.ДиспетчерСериализации.Создать();
	ДиспетчерСериализации.Инициализация();
	ДиспетчерСериализации.УстановитьФабрикуXDTO(СтруктураДанных.ДО.ФабрикаОбъектов);
	СтруктураДанных.ДО.Сериализатор = ДиспетчерСериализации;
	
КонецПроцедуры	

Процедура ПодготовитьТаблицуОписанийГруппировок(СтруктураДанных)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтруктураДанных.ДО.ТекстПравилОбходаДанных);
	ПрочитаннаяТаблица = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ПрочитаннаяТаблица, СтруктураДанных.ТаблицаОписанийГруппировок); 
	
КонецПроцедуры	

Процедура ПодготовитьВременныйКаталог(СтруктураДанных)
	
	СтруктураДанных.ВременныйКаталог  = ПолучитьИмяВременногоФайла()+ПолучитьРазделительПути();
	СоздатьКаталог(СтруктураДанных.ВременныйКаталог);
	
	
КонецПроцедуры

Процедура ПрочитатьДанныеИзДопнастроекФормата(СтруктураДанных)
	
	ДопНастройка = СтруктураДанных.ИсходныеДанные.ПараметрыВыгрузки.Найти("КодУчр","Имя");
	
	Если ДопНастройка = Неопределено Тогда 
		СтруктураДанных.КодУчрежденияДляСдачиОтчетности = "";
	Иначе 
		СтруктураДанных.КодУчрежденияДляСдачиОтчетности = ДопНастройка.Значение;
	КонецЕсли;	
	
	
	ДопНастройка =СтруктураДанных.ИсходныеДанные.ПараметрыВыгрузки.Найти("КодСценарияПолучателя","Имя");
	
	Если ДопНастройка = Неопределено Тогда 
		СтруктураДанных.КодСценарияПолучателя = "";
	Иначе 
		СтруктураДанных.КодСценарияПолучателя = ДопНастройка.Значение;
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ИнициализироватьТаблицуКодовОрганизаций(СтруктураДанных)
	
	Если Не СтруктураДанных.ИспользоватьТаблицуКодовОрганизаций Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ БюджетнаяОтчетностьКлиентСервер.ЭтоБухгалтерияБюджетногоУчреждения() Тогда 
		Возврат;
	КонецЕсли;	
	
	СвойствоКодДляСдачиОтчетности = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("КодОтчУчр");
	
	Если СвойствоКодДляСдачиОтчетности = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Свойство", СвойствоКодДляСдачиОтчетности);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Организация,
	|	ЗначенияСвойствОбъектов.Значение КАК КодДляСдачиОтчетности
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &Свойство";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;	
	
	СтруктураДанных.ТаблицаКодовОрганизаций = Результат.Выгрузить();
	СтруктураДанных.ТаблицаКодовОрганизаций.Индексы.Добавить("Организация");
	
КонецПроцедуры

// Общая
////////////////////////////////////////////////////////////////////////////////
// Для пакета

Процедура ИнициализацияДанныхПакета(СтруктураДанных)
	
	СформироватьПутьФайла(СтруктураДанных);
	СобратьДанныеПоОтчетамПакета(СтруктураДанных);
	ПодготовитьЗаписьXML(СтруктураДанных);
	
	СтруктураДанных.ТП.ИспользуемыеГруппировки = Новый Массив;
	
КонецПроцедуры

Процедура СформироватьПутьФайла(СтруктураДанных)
	
	Шаблон = "%1_%2_%3.xml";
	
	ИмяФайла = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,
		СокрЛП(Лев(Строка(СтруктураДанных.ТП.СтрокаТаблицыДанных.Организация),80)),
		МнемоникаПериода(СтруктураДанных.ТП.СтрокаТаблицыДанных.Период),
		СокрЛП(СтруктураДанных.КодСценарияПолучателя));
	
	ИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайла,"");
	
	
	СтруктураДанных.ТП.ПутьФайлаXML = СтруктураДанных.ВременныйКаталог+ИмяФайла;
	
КонецПроцедуры

Функция МнемоникаПериода(Период)
	
	мПериодичность = БюджетнаяОтчетностьСервер.ПолучитьМенеджерПериодичность();	
	
	Если Период.Периодичность = мПериодичность.Год Тогда
		Результат = Формат(Период.ДатаНачала, "ДФ=yyyy");
		
	ИначеЕсли Период.Периодичность = мПериодичность.ДевятьМесяцев Тогда
		Результат = Формат(Период.ДатаОкончания, "ДФ=yyyy""n""");
		
	ИначеЕсли Период.Периодичность = мПериодичность.Полугодие Тогда
		Результат = Формат(Период.ДатаОкончания, "ДФ=yyyy") + "h" + ?(Месяц(Период.ДатаОкончания) < 7, "1", "2");
		
	ИначеЕсли Период.Периодичность = мПериодичность.Квартал Тогда
		Результат = Формат(Период.ДатаОкончания, "ДФ=yyyy""q""q");
		
	ИначеЕсли Период.Периодичность = мПериодичность.Месяц Тогда
		Результат = Формат(Период.ДатаОкончания, "ДФ=yyyyMM");
		
	ИначеЕсли Период.Периодичность = мПериодичность.Декада Тогда
		Результат = Формат(Период.ДатаНачала, "ДФ=yyyyMM""x""dd");
		
	ИначеЕсли Период.Периодичность = мПериодичность.День Тогда
		Результат = Формат(Период.ДатаНачала, "ДФ=yyyyMMdd");
		
	Иначе
		Результат = Формат(Период.ДатаОкончания, "ДФ=yyyyMMdd") + "_" + Формат(Период.ДатаНачала, "ДФ=yyyyMMdd");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


Процедура СобратьДанныеПоОтчетамПакета(СтруктураДанных)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("СписокДокументов", СтруктураДанных.ТП.СтрокаТаблицыДанных.Отчеты.ВыгрузитьКолонку("Отчет"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УниверсальныйРегламентированныйОтчет.Ссылка КАК Ссылка,
	|	УниверсальныйРегламентированныйОтчет.ВидОтчета,
	|	УниверсальныйРегламентированныйОтчет.Организация,
	|	УниверсальныйРегламентированныйОтчет.ПериодОтчета,
	|	УниверсальныйРегламентированныйОтчет.Дата КАК Дата,
	|	УниверсальныйРегламентированныйОтчет.ВидОтчета.Код КАК ВидОтчетаКод,
	|	УниверсальныйРегламентированныйОтчет.ВидОтчета.КодФормыПоКлассификатору КАК ВидОтчетаКодФормыПоКлассификатору,
	|	УниверсальныйРегламентированныйОтчет.Редакция.ДатаРедакции КАК РедакцияДатаРедакции,
	|	УниверсальныйРегламентированныйОтчет.РезультатЗаполнения,
	|	УниверсальныйРегламентированныйОтчет.ДатаЗаполнения
	|ПОМЕСТИТЬ СписокДокументов
	|ИЗ
	|	Документ.УниверсальныйРегламентированныйОтчет КАК УниверсальныйРегламентированныйОтчет
	|ГДЕ
	|	УниверсальныйРегламентированныйОтчет.ПометкаУдаления = ЛОЖЬ
	|	И УниверсальныйРегламентированныйОтчет.Ссылка В(&СписокДокументов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокДокументов.Ссылка КАК Ссылка,
	|	СписокДокументов.ВидОтчета,
	|	СписокДокументов.Дата,
	|	СписокДокументов.ВидОтчетаКод,
	|	СписокДокументов.ВидОтчетаКодФормыПоКлассификатору,
	|	СписокДокументов.РедакцияДатаРедакции,
	|	СписокДокументов.Ссылка.ПараметрыОтчета.(
	|		Код КАК Код,
	|		Значение КАК Значение
	|	) КАК Параметры,
	|	СписокДокументов.РезультатЗаполнения,
	|	СписокДокументов.ДатаЗаполнения
	|ИЗ
	|	СписокДокументов КАК СписокДокументов";
	СтруктураДанных.ТП.ДанныеОтчетов = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияДополнительныхРеквизитовОтчета.ЭкземплярОтчета КАК Ссылка,
	|	ЗначенияДополнительныхРеквизитовОтчета.ДополнительныйРеквизитОтчета.ВидАналитики.ПубличныйИдентификатор КАК Ключ,
	|	ЗначенияДополнительныхРеквизитовОтчета.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ЗначенияДополнительныхРеквизитовОтчета КАК ЗначенияДополнительныхРеквизитовОтчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокДокументов КАК СписокДокументов
	|		ПО ЗначенияДополнительныхРеквизитовОтчета.ЭкземплярОтчета = СписокДокументов.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	ЗначенияДополнительныхРеквизитовОтчета.ДополнительныйРеквизитОтчета.ПорядковыйНомер";
	СтруктураДанных.ТП.ДанныеАналитикОтчетов = Запрос.Выполнить().Выгрузить();
	СтруктураДанных.ТП.ДанныеАналитикОтчетов.Индексы.Добавить("Ссылка");

	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Объект КАК Справочник.СтрокиОтчетов) КАК СтрокаОтчета,
	|	ЗначенияСвойствОбъектов.Свойство.УточнениеТипа.ПубличныйИдентификатор КАК Ключ,
	|	ЗначенияСвойствОбъектов.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект ССЫЛКА Справочник.СтрокиОтчетов
	|	И ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Объект КАК Справочник.СтрокиОтчетов).Владелец В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Док.ВидОтчета
	|			ИЗ
	|				СписокДокументов КАК Док)
	|	И ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.КодСтроки)
	|	И ЗначенияСвойствОбъектов.Свойство.УточнениеТипа <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.АналитикаОтчетов.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Объект КАК Справочник.СтрокиОтчетов),
	|	""urn:entities-1c-ru:reports/rowCode"",
	|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Значение КАК СТРОКА(256))
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект ССЫЛКА Справочник.СтрокиОтчетов
	|	И ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Объект КАК Справочник.СтрокиОтчетов).Владелец В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Док.ВидОтчета
	|			ИЗ
	|				СписокДокументов КАК Док)
	|	И ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.КодСтроки)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтрокаОтчета,
	|	Ключ";
	СтруктураДанных.ТП.ДанныеКлючейСтрокОтчетов = Запрос.Выполнить().Выгрузить();
	СтруктураДанных.ТП.ДанныеКлючейСтрокОтчетов.Индексы.Добавить("СтрокаОтчета");
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АналитикаПоказателей.ЭкземплярОтчета КАК Ссылка,
	|	АналитикаПоказателей.ГруппаРаскрытия КАК ГруппаРаскрытия,
	|	АналитикаПоказателей.Индекс КАК ИндексСтроки,
	|	АналитикаПоказателей.ВидАналитики.ПубличныйИдентификатор КАК Ключ,
	|	АналитикаПоказателей.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.АналитикаПоказателей КАК АналитикаПоказателей
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыРаскрытия.Аналитика КАК ГруппыРаскрытияАналитика
	|		ПО АналитикаПоказателей.ГруппаРаскрытия = ГруппыРаскрытияАналитика.Ссылка
	|			И АналитикаПоказателей.ВидАналитики = ГруппыРаскрытияАналитика.ВидАналитики
	|ГДЕ
	|	АналитикаПоказателей.ЭкземплярОтчета В
	|			(ВЫБРАТЬ
	|				Док.Ссылка
	|			ИЗ
	|				СписокДокументов КАК Док)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	ГруппаРаскрытия,
	|	ЕСТЬNULL(ГруппыРаскрытияАналитика.НомерСтроки, 99999)";
	СтруктураДанных.ТП.ДанныеАналитикиРаскрытий = Запрос.Выполнить().Выгрузить();
	СтруктураДанных.ТП.ДанныеАналитикиРаскрытий.Индексы.Добавить("Ссылка, ГруппаРаскрытия, ИндексСтроки");

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗначенияПоказателейОтчетов.ЭкземплярОтчета КАК Ссылка,
	|	ЗначенияПоказателейОтчетов.Показатель.Строка КАК СтрокаОтчета,
	|	ЗначенияПоказателейОтчетов.Показатель.Строка.Код КАК СтрокаОтчетаКод,
	|	ЗначенияПоказателейОтчетов.Показатель.Строка.ГруппаРаскрытия КАК ГруппаРаскрытия,
	|	ЗначенияПоказателейОтчетов.Индекс КАК ИндексСтроки,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Значение КАК СТРОКА(256)), ""urn:entities-1c-ru:user/resource/"" + ЗначенияПоказателейОтчетов.Показатель.Колонка.Код) КАК ПоказательКлюч,
	|	ЗначенияПоказателейОтчетов.Показатель.Строка КАК ПоказательСтрока,
	|	ЗначенияПоказателейОтчетов.Показатель.Код КАК ПоказательКод,
	|	ЗначенияПоказателейОтчетов.Показатель.Строка.ПорядковыйНомер КАК ПоказательСтрокаПорядковыйНомер,
	|	ЗначенияПоказателейОтчетов.Показатель.Колонка.ПорядковыйНомер КАК ПоказательКолонкаПорядковыйНомер,
	|	ЗначенияПоказателейОтчетов.Показатель.ТипЗначения КАК ПоказательТипЗначения,
	|	ЗначенияПоказателейОтчетов.Показатель.НеограниченнаяДлина КАК ПоказательНеограниченнаяДлина,
	|	ЗначенияПоказателейОтчетов.Значение КАК ПоказательЗначение,
	|	ЗначенияПоказателейОтчетов.ЗначениеНеограниченнаяСтрока КАК ПоказательЗначениеНеограниченное,
	|	ЗначенияПоказателейОтчетов.ПромежуточныйИтог КАК ПромежуточныйИтог
	|ИЗ
	|	РегистрСведений.ЗначенияПоказателейОтчетов КАК ЗначенияПоказателейОтчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО ЗначенияПоказателейОтчетов.Показатель.Колонка = ЗначенияСвойствОбъектов.Объект
	|			И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.ПубличныйИдентификатор))
	|ГДЕ
	|	ЗначенияПоказателейОтчетов.ЭкземплярОтчета В
	|			(ВЫБРАТЬ
	|				Док.Ссылка
	|			ИЗ
	|				СписокДокументов КАК Док)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	ПоказательСтрокаПорядковыйНомер,
	|	ИндексСтроки,
	|	ПоказательКолонкаПорядковыйНомер
	|ИТОГИ ПО
	|	Ссылка,
	|	СтрокаОтчета ИЕРАРХИЯ,
	|	ИндексСтроки";
	
	СтруктураДанных.ТП.ДанныеСтрокОтчетов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	

КонецПроцедуры	

Процедура ПодготовитьЗаписьXML(СтруктураДанных)
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(СтруктураДанных.ТП.ПутьФайлаXML, "UTF-8");	
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	
	СтруктураДанных.ТП.ЗаписьXML = ЗаписьXML;
	
КонецПроцедуры

// Для пакета
// Инициализация
////////////////////////////////////////////////////////////////////////////////
// Формирование xml файлов

Процедура ВыгрузитьОтчеты(СтруктураДанных)
	
	ЗаписатьНачалоФайла(СтруктураДанных);
	
	ЗаписатьОсновныеДанныеФайла(СтруктураДанных);
	
	ЗаписатьКонецФайла(СтруктураДанных);
	
КонецПроцедуры 

Процедура ЗаписатьНачалоФайла(СтруктураДанных)
	ЗаписьXML = СтруктураДанных.ТП.ЗаписьXML;
	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("envelope", СтруктураДанных.ДО.URLПространстваИмен);
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("", СтруктураДанных.ДО.URLПространстваИмен);
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("core", "urn:schemas-1c-ru:reports/core");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("budg", "urn:schemas-1c-ru:reports/budget/base");
	
	ЗаписьXML.ЗаписатьАтрибут("type", "http://www.w3.org/2001/XMLSchema-instance", "ReportEnvelope");
	
	ЗаписьXML.ЗаписатьАтрибут("version",     "", "2.0");
	ЗаписьXML.ЗаписатьАтрибут("created",     "", XMLСтрока(ТекущаяДата()));
	ЗаписьXML.ЗаписатьАтрибут("generator",   "", XMLСтрока(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1/%2", Метаданные.Имя,Метаданные.Версия)));
	ЗаписьXML.ЗаписатьАтрибут("reportCount", "", XMLСтрока(СтруктураДанных.ТП.СтрокаТаблицыДанных.Отчеты.Количество()));
	
	ВывестиГруппировку("Период", СтруктураДанных.ТП.СтрокаТаблицыДанных.Период, СтруктураДанных);
	

	Если ЗначениеЗаполнено(АдресПубликацииИБ)
		И Строка(СпособВыгрузки) = "Web-сервис"
		И ОбщегоНазначения.РазделениеВключено() Тогда
		ЗаписатьКлючXML("http://purl.org/dc/terms/ns", АдресПубликацииИБ, СтруктураДанных);
		//Обл = РаботаВМоделиСервиса.ЗначениеРазделителяСеанса();
		//ЗаписатьКлючXML("http://purl.org/dc/terms/zone", Формат(Обл,"ЧГ=0"), СтруктураДанных); //разделитель области
	КонецЕсли;

	
	ВывестиГруппировку("Организация", СтруктураДанных.ТП.СтрокаТаблицыДанных.Организация, СтруктураДанных);
	ВывестиГруппировку("Сценарий", СтруктураДанных.КодСценарияПолучателя, СтруктураДанных);
	
	
КонецПроцедуры	

Процедура ВывестиГруппировку(Группировка, Значение ,СтруктураДанных)
	
	ЗаписьXML = СтруктураДанных.ТП.ЗаписьXML;
	
	ОписаниеГруппировки = СтруктураДанных.ТаблицаОписанийГруппировок.Найти(Группировка,"Группировка");
	
	Если ОписаниеГруппировки = Неопределено Тогда 
		ВызватьИсключение НСтр("ru = 'Неизвестная группировка.'");
	КонецЕсли;	
	
	ВывестиГруппировку = ОписаниеГруппировки.Обязательная Или ЗначениеЗаполнено(Значение);
	Если Не ВывестиГруппировку Тогда 
		Возврат;
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("group", СтруктураДанных.ДО.URLПространстваИмен);
	ЗаписатьКлючXML(ОписаниеГруппировки.ПубличныйИдентификатор, Значение, СтруктураДанных);
	
	Если Группировка = "Организация" Тогда
		
		Если СтруктураДанных.ИспользоватьТаблицуКодовОрганизаций И ЗначениеЗаполнено(СтруктураДанных.ТаблицаКодовОрганизаций) Тогда
			СтрокаТаблицыКодов = СтруктураДанных.ТаблицаКодовОрганизаций.Найти(Значение,"Организация");
			Если СтрокаТаблицыКодов <> Неопределено Тогда
				ЗаписатьКлючXML("urn:entities-1c-ru:properties/administrative-id", СокрЛП(СтрокаТаблицыКодов.КодДляСдачиОтчетности), СтруктураДанных);
			КонецЕсли;
			
		ИначеЕсли Не ПустаяСтрока(СтруктураДанных.КодУчрежденияДляСдачиОтчетности) Тогда
			ЗаписатьКлючXML("urn:entities-1c-ru:properties/administrative-id", СокрЛП(СтруктураДанных.КодУчрежденияДляСдачиОтчетности), СтруктураДанных);
	
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураДанных.ТП.ИспользуемыеГруппировки.Добавить(Группировка);
	
КонецПроцедуры	

Процедура ЗаписатьКлючXML(ПубличныйИдентификатор, Значение,СтруктураДанных)
	ЗаписьXML = СтруктураДанных.ТП.ЗаписьXML;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("key", СтруктураДанных.ДО.URLПространстваИмен);
	ЗаписьXML.ЗаписатьАтрибут("about", "", XMLСтрока(СокрЛП(ПубличныйИдентификатор)));
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		Значение = СокрП(Значение);
	КонецЕсли;
	
	ОбъектXDTO = СтруктураДанных.ДО.Сериализатор.ЗаписатьXDTO(Значение);
	
	СтруктураДанных.ДО.ФабрикаОбъектов.ЗаписатьXML(ЗаписьXML,
	ОбъектXDTO,
	"value",
	СтруктураДанных.ДО.URLПространстваИмен,
	ФормаXML.Элемент,
	НазначениеТипаXML.Явное);
	
	ЗаписьXML.ЗаписатьКонецЭлемента();// key
	
КонецПроцедуры

Процедура ЗаписатьКонецФайла(СтруктураДанных)
	ЗаписьXML = СтруктураДанных.ТП.ЗаписьXML;
	
	Для Каждого ГруппировкаДляЗакрытия Из СтруктураДанных.ТП.ИспользуемыеГруппировки Цикл 
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // group
		
	КонецЦикла;
	
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // envelope
	ЗаписьXML.Закрыть();
	
	
КонецПроцедуры

Процедура ЗаписатьОсновныеДанныеФайла(СтруктураДанных)
	ЗаписьXML = СтруктураДанных.ТП.ЗаписьXML;
		
	Для Каждого ДанныеОтчета Из СтруктураДанных.ТП.ДанныеОтчетов Цикл 
		СтруктураДанных.СлужебныеДанныеОтчета = ДанныеОтчета;
		
		
		ОтчетXDTO = НовыйОбъектXDTO("Report", СтруктураДанных);
		ОтчетXDTO.refName = СокрП(ДанныеОтчета.ВидОтчетаКод);
		
		Если ВыгружатьДанныеЗаполнения Тогда
			
			СтруктураДанныхЗаполнения = ДанныеОтчета.РезультатЗаполнения.Получить();
			
			Если СтруктураДанныхЗаполнения<>Неопределено Тогда
				Если СтруктураДанныхЗаполнения.Свойство("ДатаЗаполнения") Тогда
					
					СтруктураБланков = Новый Структура;
					Если СтруктураДанныхЗаполнения.Свойство("Бланк") Тогда
						//старый вариант - одностраничный бланк
						СтруктураБланков.Вставить("Стр_1",СтруктураДанныхЗаполнения.Бланк);
					ИначеЕсли СтруктураДанныхЗаполнения.Свойство("СтруктураБланков") Тогда
						//новый вариант - многостраничный бланк
						СтруктураБланков = СтруктураДанныхЗаполнения.СтруктураБланков;			
					КонецЕсли;
	
				    ИмяВремФайлаАрхива = ПолучитьИмяВременногоФайла("zip");
					
					ТекКаталогАрхива = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПолучитьИмяВременногоФайла());
					СоздатьКаталог(ТекКаталогАрхива);
		
					Архив = Новый ЗаписьZipФайла(ИмяВремФайлаАрхива);
					
					Для Каждого КлючИЗначение Из СтруктураБланков Цикл
					
						ИмяВремФайлаДок = ПолучитьИмяВременногоФайла("mxl");
					
						ДанныеЗаполнения = КлючИЗначение.Значение;
						ДанныеЗаполнения.Записать(ИмяВремФайлаДок);
					
					    ПереместитьФайл(ИмяВремФайлаДок, ТекКаталогАрхива + КлючИЗначение.Ключ + ".mxl");
						Архив.Добавить(ТекКаталогАрхива + КлючИЗначение.Ключ + ".mxl");
					
					КонецЦикла;
					
					Архив.Записать();
					
					АдресДерева = Документы.УниверсальныйРегламентированныйОтчет.ПолучитьАдресДереваБланкаПоСсылке(ДанныеОтчета.Ссылка);
					
					ДеревоСтраниц = ПолучитьИзВременногоХранилища(АдресДерева);
					УдалитьИзВременногоХранилища(АдресДерева);
					
					КоллекцияСтрок = ДеревоСтраниц.Строки;
					ДанныеОтличаются = Ложь;
					
					ПроверитьОтличияКоллекцииСтраницЗаполнения(ДанныеОтчета.Ссылка, КоллекцияСтрок, СтруктураБланков, ДанныеОтличаются);					
														
					ТекДвоичныеДанные = Новый ДвоичныеДанные(ИмяВремФайлаАрхива);
					
					dataFillings = НовыйОбъектXDTO("DataFillings", СтруктураДанных);
					dataFillings.data = Base64Строка(ТекДвоичныеДанные);
					dataFillings.difference = ДанныеОтличаются;
					dataFillings.dtime = СтруктураДанныхЗаполнения.ДатаЗаполнения;
					
					ОтчетXDTO.dataFillings = dataFillings;
					
					ТекДвоичныеДанные = Неопределено;
					Архив = Неопределено;
					ДанныеЗаполнения = Неопределено;
					
					УдалитьФайлы(ИмяВремФайлаАрхива);
					УдалитьФайлы(ИмяВремФайлаДок);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		МассивФайловОтчета = ПрисоединенныеФайлыДляВыгрузки.НайтиСтроки(Новый Структура("Отчет",ДанныеОтчета.Ссылка));
		Если МассивФайловОтчета.Количество() Тогда
			
		    ИмяВремФайлаАрхива = ПолучитьИмяВременногоФайла("zip");
			
			ТекКаталогАрхива = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПолучитьИмяВременногоФайла());
			СоздатьКаталог(ТекКаталогАрхива);

			Архив = Новый ЗаписьZipФайла(ИмяВремФайлаАрхива);
			
			ИменаФайловВАрхиве = Новый Соответствие;
			ПараметрыДанныхФайла = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
			Для Каждого СтрФайла Из МассивФайловОтчета Цикл
				ДанныеФайла = РаботаСФайлами.ДанныеФайла(СтрФайла.СсылкаНаПрисоединенныйФайл,ПараметрыДанныхФайла);
				ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
				
				ИмяВремФайлаДок = ПолучитьИмяВременногоФайла();
				ДвоичныеДанныеФайла.Записать(ИмяВремФайлаДок);
				
				ИмяФайлаДляАрхива = ДанныеФайла.ИмяФайла;
				Если ИменаФайловВАрхиве[ИмяФайлаДляАрхива] <> Неопределено Тогда
					ИмяФайлаБезРасширения = Сред(ИмяФайлаДляАрхива,1,СтрДлина(ИмяФайлаДляАрхива)-(СтрДлина(ДанныеФайла.Расширение)+1));
					Для Инд = 1 По 999 Цикл
						ИмяФайлаДляАрхива = ИмяФайлаБезРасширения+"_"+Инд+"."+ДанныеФайла.Расширение;
						Если ИменаФайловВАрхиве[ИмяФайлаДляАрхива] = Неопределено Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;
									
				ИменаФайловВАрхиве.Вставить(ИмяФайлаДляАрхива,Истина);
				
				ПереместитьФайл(ИмяВремФайлаДок, ТекКаталогАрхива + ИмяФайлаДляАрхива);
				Архив.Добавить(ТекКаталогАрхива + ИмяФайлаДляАрхива);
			КонецЦикла;
			
			Архив.Записать();
													
			ТекДвоичныеДанные = Новый ДвоичныеДанные(ИмяВремФайлаАрхива);
			
			repFiles = НовыйОбъектXDTO("RepFiles", СтруктураДанных);
			repFiles.data = Base64Строка(ТекДвоичныеДанные);
			repFiles.count = МассивФайловОтчета.Количество();
			
			ОтчетXDTO.repFiles = repFiles;
			
			ТекДвоичныеДанные = Неопределено;
			Архив = Неопределено;
			
			УдалитьФайлы(ИмяВремФайлаАрхива);
			УдалитьФайлы(ИмяВремФайлаДок);
		КонецЕсли;
		
		//Т.к. не во всех конфигурациях есть значение перечисления WebСервис, сравниваем со строкой
		Если Строка(СпособВыгрузки) = "Web-сервис" Тогда
			//Если это БГУ, то необходимо добавлять ключ urn:entities-1c-ru:reports/initialReportGuid со значением уникального идентификатора ссылки текущего отчета.
			//Причем ключ должен заполняться, только если это обмен через сервис.
			//Если это Свод отчетов, то этот ключ не требуется.
			ОтчетXDTO.key.Добавить(СоздатьКлючXDTO("urn:entities-1c-ru:reports/initialReportGuid",,Строка(ДанныеОтчета.Ссылка.УникальныйИдентификатор()),СтруктураДанных));
		КонецЕсли;

		ОтчетXDTO.key.Добавить(СоздатьКлючXDTO("urn:entities-1c-ru:reports/form-ref",, СокрП(ДанныеОтчета.ВидОтчетаКод),СтруктураДанных));
		Если Не ПустаяСтрока(ДанныеОтчета.ВидОтчетаКодФормыПоКлассификатору) Тогда
			ОтчетXDTO.key.Добавить(СоздатьКлючXDTO("urn:entities-1c-ru:reports/formCode",, СокрП(ДанныеОтчета.ВидОтчетаКодФормыПоКлассификатору),СтруктураДанных));
		КонецЕсли;
		
		СтруктураОтбора = Новый Структура("Ссылка",ДанныеОтчета.Ссылка);
		АналитическиеРазрезыОтчета = СтруктураДанных.ТП.ДанныеАналитикОтчетов.НайтиСтроки(СтруктураОтбора);
		ДобавитьКлючиXDTO(ОтчетXDTO.key, АналитическиеРазрезыОтчета,СтруктураДанных);
		
		ОтчетXDTO.resource.Добавить(СоздатьКлючXDTO("http://purl.org/dc/terms/created",,        ДанныеОтчета.Дата,СтруктураДанных));
		ОтчетXDTO.resource.Добавить(СоздатьКлючXDTO("urn:entities-1c-ru:reports/edition",,      ДанныеОтчета.РедакцияДатаРедакции,СтруктураДанных));
		
		Для Каждого ПараметрОтчета Из ДанныеОтчета.Параметры Цикл  
			ОтчетXDTO.resource.Добавить(СоздатьКлючXDTO(, ПараметрОтчета.Код, ПараметрОтчета.Значение,СтруктураДанных));
		КонецЦикла;
		
		СтруктураДанных.ТП.ДанныеСтрокОтчетов.Сбросить();
		
		Если СтруктураДанных.ТП.ДанныеСтрокОтчетов.НайтиСледующий(СтруктураОтбора) Тогда
			
			ДочерняяВыборка = СтруктураДанных.ТП.ДанныеСтрокОтчетов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "СтрокаОтчета");
			
			Попытка
				
				ЗаписатьСтрокиXDTO(ОтчетXDTO, ДочерняяВыборка, СтруктураДанных);
				
			Исключение
				
				Шаблон = НСтр("ru = 'Отчет «%1» не записан.
                               |%2'");
				Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,ДанныеОтчета.Ссылка,ОписаниеОшибки());
				
				ВызватьИсключение Сообщение;
				
			КонецПопытки;
			
		КонецЕсли;
		
		// Документ по которому не было движений выгружается, как пустой отчет.
		СтруктураДанных.ДО.ФабрикаОбъектов.ЗаписатьXML(ЗаписьXML,
			ОтчетXDTO,
			"group",
			СтруктураДанных.ДО.URLПространстваИмен,
			ФормаXML.Элемент,
			НазначениеТипаXML.Явное);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьОтличияКоллекцииСтраницЗаполнения(Знач ОтчетСсылка, Знач КоллекцияСтрок, Знач СтруктураБланков, ДанныеОтличаются)
		
	Для Каждого СтраницаДерева Из КоллекцияСтрок Цикл
		
		ВыводимыйБланк = ПолучитьИзВременногоХранилища(СтраницаДерева.АдресБланка);
		
		Если СтруктураБланков.Свойство(СтраницаДерева.ИмяСтраницы) Тогда
			СохраненныйБланк = СтруктураБланков[СтраницаДерева.ИмяСтраницы];
		Иначе
			СохраненныйБланк = Новый ТабличныйДокумент;
		КонецЕсли;
		
		СтруктураПараметров = Новый Структура();
		СтруктураПараметров.Вставить("ТабличныеДокументыЗаполнены", Истина);
		СтруктураПараметров.Вставить("ТабличныйДокументВерсия1", ВыводимыйБланк);
		СтруктураПараметров.Вставить("ТабличныйДокументВерсия2", СохраненныйБланк);
		
		СтруктураПараметров.Вставить("ВариантСравнения","ДанныеОтчета");
		
		СтруктураПараметров.Вставить("ОтчетСсылка", ОтчетСсылка);
		СтруктураПараметров.Вставить("ИзмененныеОбласти", Новый Массив);
		
		ДанныеОтличаются = НЕ Документы.УниверсальныйРегламентированныйОтчет.ВерсииОтчетаИдентичны(СтруктураПараметров);
		
		Если ДанныеОтличаются Тогда
			Прервать;
		КонецЕсли;
		
		Если СтраницаДерева.Строки.Количество()>0 Тогда
			ПроверитьОтличияКоллекцииСтраницЗаполнения(ОтчетСсылка, СтраницаДерева.Строки, СтруктураБланков, ДанныеОтличаются);
			Если ДанныеОтличаются Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция СоздатьКлючXDTO(ПубличныйИдентификатор = "", Код = "", Значение,СтруктураДанных)
	
	Результат = НовыйОбъектXDTO("NamedValue", СтруктураДанных);
	
	Если Не ПустаяСтрока(ПубличныйИдентификатор) Тогда
		Результат.about = СокрП(ПубличныйИдентификатор);
	КонецЕсли;
	
	Если Не ПустаяСтрока(Код) Тогда
		Результат.code = СокрП(Код);
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		ЗначениеКЗаписи = СокрП(Значение);
	Иначе
		ЗначениеКЗаписи = Значение;
	КонецЕсли;
	
	Если Значение <> Неопределено Тогда
		
		Попытка
			Результат.value = СтруктураДанных.ДО.Сериализатор.ЗаписатьXDTO(ЗначениеКЗаписи);
		Исключение
			
			Шаблон = НСтр("ru = 'Пара ключ-значение на записана (ключ: ‘%1%’; значение: ‘%2%’).
			|%3'");
			Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, ПубличныйИдентификатор, Значение, ОписаниеОшибки());
			
			ВызватьИсключение Сообщение;
			
		КонецПопытки;
	Иначе
		Результат.value = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьКлючиXDTO(СписокКлючейXDTO, МассивСтрокТаблицыКлючей, СтруктураДанных)
	
	Для Каждого АналитическийРазрез Из МассивСтрокТаблицыКлючей Цикл
		СписокКлючейXDTO.Добавить(СоздатьКлючXDTO(АналитическийРазрез.Ключ, , АналитическийРазрез.Значение, СтруктураДанных));
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьПоказателиXDTO(ГруппировкаXDTO, Выборка, СтруктураДанных)
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ПоказательНеограниченнаяДлина Тогда 
			Значение = Выборка.ПоказательЗначениеНеограниченное;
		Иначе 
			Значение = Выборка.ПоказательЗначение;
		КонецЕсли;	
		
		КлючXDTO = СоздатьКлючXDTO(Выборка.ПоказательКлюч,Выборка.ПоказательКод,Значение,СтруктураДанных);
												
		Если Выборка.ПромежуточныйИтог = Истина Тогда
			КлючXDTO.subtotals = Истина;
		КонецЕсли;
												
		ГруппировкаXDTO.resource.Добавить(КлючXDTO);
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьРаскрытияXDTO(СтрокаОтчетаXDTO, Выборка, СтруктураДанных)
	
	СтруктураОтбора = Новый Структура("Ссылка, ГруппаРаскрытия, ИндексСтроки");
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.ИндексСтроки) Тогда // Итоговая или нераскрываемая строка.
			
			ГруппировкаXDTO = СтрокаОтчетаXDTO;
			
		Иначе
			
			РаскрытиеXDTO = НовыйОбъектXDTO("Group", СтруктураДанных);
			ЗаполнитьЗначенияСвойств(СтруктураОтбора, Выборка);
			АналитическиеРазрезыСтрокиРаскрытия = СтруктураДанных.ТП.ДанныеАналитикиРаскрытий.НайтиСтроки(СтруктураОтбора);
			
			Попытка
				
				Если Выборка.ГруппаРаскрытия.РазрешитьСовпаденияИзмерений Тогда
					РаскрытиеXDTO.key.Добавить(СоздатьКлючXDTO("urn:entities-1c-ru:reports/accrualIndex",, Выборка.ИндексСтроки,СтруктураДанных));
				КонецЕсли;
				ДобавитьКлючиXDTO(РаскрытиеXDTO.key, АналитическиеРазрезыСтрокиРаскрытия,СтруктураДанных);
				
			Исключение
				
				Шаблон = НСтр("ru = 'Аналитика строки раскрытия (номер строки: %1) не записана.
				|%2'");
				Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,Выборка.ИндексСтроки,ОписаниеОшибки());
				
				ВызватьИсключение Сообщение;
				
			КонецПопытки;
			
			СтрокаОтчетаXDTO.group.Добавить(РаскрытиеXDTO);
			ГруппировкаXDTO = РаскрытиеXDTO;
			
		КонецЕсли;
		
		ДочерняяВыборка = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "");
		
		Попытка
			ЗаписатьПоказателиXDTO(ГруппировкаXDTO, ДочерняяВыборка,СтруктураДанных);
		Исключение
			
			Шаблон = НСтр("ru = 'Показатели не записаны (номер строки: %1).
			|%2'");
			Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,Выборка.ИндексСтроки,ОписаниеОшибки());
			
			ВызватьИсключение Сообщение;
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьСтрокиXDTO(ГруппировкаXDTO, Выборка, СтруктураДанных)
	
	СтруктураОтбора = Новый Структура("СтрокаОтчета");
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаОтчета = Выборка.СтрокаОтчета;
		
		СтрокаОтчетаXDTO = НовыйОбъектXDTO("Group", СтруктураДанных);
		
		СтрокаОтчетаXDTO.key.Добавить(СоздатьКлючXDTO("urn:entities-1c-ru:reports/row-ref",, СокрП(Выборка.СтрокаОтчетаКод),СтруктураДанных));
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, Выборка);
		АналитическиеРазрезыСтроки = СтруктураДанных.ТП.ДанныеКлючейСтрокОтчетов.НайтиСтроки(СтруктураОтбора);
		ДобавитьКлючиXDTO(СтрокаОтчетаXDTO.key, АналитическиеРазрезыСтроки, СтруктураДанных);
		
		ДочерняяВыборка = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "СтрокаОтчета");
		ЗаписатьСтрокиXDTO(СтрокаОтчетаXDTO, ДочерняяВыборка,  СтруктураДанных);
		
		ВыборкаПоИндексу = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ИндексСтроки");
		Попытка
			ЗаписатьРаскрытияXDTO(СтрокаОтчетаXDTO, ВыборкаПоИндексу,  СтруктураДанных);
		Исключение
			
			Шаблон = НСтр("ru = 'Строка «%1» не записана.
			|%2'");
			Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, Выборка.ПоказательСтрока, ОписаниеОшибки());

			ВызватьИсключение Сообщение;
			
		КонецПопытки;
		
		ГруппировкаXDTO.group.Добавить(СтрокаОтчетаXDTO);
		
	КонецЦикла;
	
КонецПроцедуры

Функция НовыйОбъектXDTO(ИмяТипа, СтруктураДанных)
	
	Фабрика = СтруктураДанных.ДО.ФабрикаОбъектов;
	Возврат Фабрика.Создать(Фабрика.Тип(СтруктураДанных.ДО.URLПространстваИмен, ИмяТипа));
	
КонецФункции // НовыйОбъектXDTO()

// Формирование xml файлов
////////////////////////////////////////////////////////////////////////////////
// Сохранение

Процедура СформироватьВыходныеФайлы(СтруктураДанных)
	
		ИмяАрхива = ПолучитьИмяВременногоФайла("ZIP");
		
		Архив = Новый ЗаписьZipФайла(ИмяАрхива); 
		Архив.Добавить(СтруктураДанных.ТП.ПутьФайлаXML, РежимСохраненияПутейZIP.НеСохранятьПути);
		Архив.Записать();
		
		НоваяСтрока = СтруктураДанных.ТП.СтрокаТаблицыДанных.ФайлыОтчетов.Добавить();
		НоваяСтрока.Группа = 0;
		НоваяСтрока.ДанныеФайлов = Новый ДвоичныеДанные(ИмяАрхива);
		
		УдалитьФайлы(ИмяАрхива);
	
КонецПроцедуры

// Сохранение
// формирование файлов отчетов 
// Служебные
////////////////////////////////////////////////////////////////////////////////

ВыгружатьДанныеЗаполнения = Ложь;


	ВыгружатьДанныеЗаполнения = Константы.ИспользоватьДанныеЗаполненияВФорматеСводОтчетов.Получить() = Истина
		ИЛИ Константы.ИспользоватьДанныеЗаполненияВФорматеСводОтчетовОбластиДанных.Получить() = Истина;

	
АдресПубликацииИБ = "";

#КонецЕсли
